website-main.org
#+hugo_base_dir: /home/aatmun/websites/personal/
#+hugo_weight: auto
#+bibliography: ~/Documents/bib/reference-texts.bib
#+bibliographystyle:
#+options: ':t todo:nil date:t
#+cite_export: csl
#+startup: logdone

** Some Theorems
:PROPERTIES:
:EXPORT_HUGO_SECTION: misc
:EXPORT_FILE_NAME: fav_theorems
:END:

#+begin_details
#+begin_summary
Table of Contents
#+end_summary
#+toc: headlines 1
#+end_details

*** Modular categories are not determined by their modular data
#+begin_details
#+begin_summary
A modular category \( \mathcal{C} \) is not determined by its \( S \) and \( T \) matrices.
#+end_summary

*Comments:* If something seems too good to be true, it probably is.
#+end_details
*** Classification of commutative Frobenius algebras by TQFTs
#+begin_details
#+begin_summary
For a field \( k \), there is an equivalence of categories \( \mathsf{2TQFT}_k \simeq \mathsf{cFrob}_k \) of 2-dimensional topological quantum field theories and commutative Frobenius algebras.
#+end_summary

*Comments:* This was the first result I learned that expressed how some classical tensor algebras arise as categorical constructions. Essential to this equivalence is the classification of closed 1-dimensional manifolds and how well behaved the category \( \mathsf{2Cob} \) is. A significant amount of work is needed to even hypothesize a higher dimensional analogue. This is the cobordism hypothesis, proposed by Baez and Dolan.
#+end_details
*** The Yoneda Lemma
#+begin_details
#+begin_summary
Let \( \mathsf{C} \) be a locally small category and \( F : \mathsf{C} \to \mathsf{Set} \) be a functor. Then
\[
\operatorname*{Hom}(\operatorname*{Hom}(X,-),F) \cong FX
\]
and this isomorphism is natural in both \(X\) and \(F\).
#+end_summary

*Comments:* This theorem is remarkable. The object on the left, as a collection of natural transformations, is seemingly incalculably large. Not only does this theorem tell us that this collection is a set, but it also gives an *explicit description* of these transformations, parameterized by \( FX \). When applied to \( F = \operatorname*{Hom}(Y,-) \) (or more generally representable functors), this theorem gives meaning to the intuitively-known idea that an object is uniquely determined by the maps into (our out of) it.
#+end_details
